import React from "react";
import logo from "./assets/logo.png";

const About: React.FC = () => {
  return (
    <div style={{ textAlign: "center", padding: "2rem" }}>
      <img
        src={logo}
        alt="Logo"
        style={{ width: "150px", marginBottom: "1rem" }}
      />
      <h1>Станция+</h1>
      <p>
        Станция+ е мобилно приложение за Android, целящо да популяризира
        забележителностите около станциите на софийското метро. Приложението
        позволява да сканирате уникален QR код на всяка метростанция, който
        показва всички забележителности около нея. Бъдещото развитие на проекта
        включва възможност за регистриране на потребители, които да могат да
        оставят коментари или да предлагат нови забележителности.
      </p>
      <p>
        Мобилното приложение представлява разработка на дипломна работа в ТУЕС.
      </p>
    </div>
  );
};

export default About;
