import React from "react";
import serdica from "./assets/serdica.jpg";
import svetapetka from "./assets/sv-petka.jpg";
import cum from "./assets/cum.jpg";
import svetanedelya from "./assets/sv-nedelya.jpg";
import rotonda from "./assets/rotonda.jpg";
import catholic from "./assets/catholic.jfif";
import mosque from "./assets/mosque.jpg";
import bath from "./assets/bath.jpg";
import shop from "./assets/shop.jpg";
import synagogue from "./assets/synagogue.jpg";
import palace from "./assets/palace.jpg";
import "./Serdica.css";
import { useNavigate } from "react-router-dom";

const Message: React.FC = () => {
  const navigate = useNavigate();

  const handleClick = () => {
    navigate("/about");
  };

  return (
    <div style={{ textAlign: "center", padding: "2rem" }}>
      <button className="message-button" onClick={handleClick}>
        Научи повече за приложението Станция+
      </button>
      <h1 className="message-title">Сердика</h1>
      <img
        src={serdica}
        alt="Serdica"
        style={{ width: "500px", marginBottom: "1rem" }}
      />
      <p className="message-description">Линии: М1, М2, М4</p>
      <a
        href="https://www.openstreetmap.org/#map=17/42.697904/23.321593"
        target="_blank"
      >
        Местоположение
      </a>
      <h2 className="message-subtitle">Забележителности:</h2>
      <h3>Средновековен храм "Света Петка Самарджийска"</h3>
      <img
        src={svetapetka}
        alt="Sveta Petka"
        style={{ width: "500px", marginBottom: "1rem" }}
      />
      <p>
        Eдна от малкото запазени работещи църкви, датиращи от IX век. Под нея е
        открита римска гробница, датираща от IV век. В църквата са открити
        няколко стенописни слоя, като най-ранният е от XIV век. Църквата е
        посветена на Света великомъченица Параскева - Петка Иконийска
        (Търновска). Наричана е "Св. Петка Самарджийска". Вероятното лобно място
        на един от българските национални герои - Васил Левски.
      </p>
      <h3>ЦУМ</h3>
      <img
        src={cum}
        alt="CUM"
        style={{ width: "500px", marginBottom: "1rem" }}
      />
      <p>
        Сградата на Централния универсален магазин, по-популярен със
        съкращението ЦУМ, е проектирана от арх. Коста Николов през 1956 г. По
        времето на социализма ЦУМ е най-модерният и престижен търговски център в
        България. Днес в сградата се разполагат бизнес офиси, магазини и
        заведенията.
      </p>
      <h3>Св. Неделя</h3>
      <img
        src={svetanedelya}
        alt="Sveta Nedelya"
        style={{ width: "500px", marginBottom: "1rem" }}
      />
      <p>
        "Света Неделя" е православна църква в София, посветена на света
        великомъченица Неделя, катедрала на софийския митрополит. До църквата се
        намира централният площад на град София, който носи същото име. През XIX
        и първите десетилетия на XX век храмът се нарича и „Свети Крал“, тъй
        като в него се съхранявали мощите на сръбския крал Стефан Милутин.
        Вероятно първоначалната църква е била построена през X в. и както други
        тогавашни софийски храмове е била с каменни основи, а нагоре с дървена
        конструкция. В този си вид храмът просъществувал чак до средата на XIX
        в. В началото на 50-те години на XIX в. Софийската митрополия и
        Софийската градска църковна община решили да изградят нов катедрален
        храм. На 7 май 1856 г. започва строежът на новата църква. Тя е
        трикорабна базилика с дължина 35,5 метра и ширина 19 метра. Църквата
        добива печална известност при атентата на 16 април 1925 г. по време на
        опелото на генерал Константин Георгиев, когато е разрушена. Убити са 193
        души, ранените са около 500. Смята се, че това е най-тежкият
        терористичен акт в историята на България, а по онова време и в света.
      </p>
      <h3>Ротонда "Св. Георги Победоносец"</h3>
      <img
        src={rotonda}
        alt="Rotonda"
        style={{ width: "500px", marginBottom: "1rem" }}
      />
      <p>
        Ротондата „Св. Георги Победоносец” е най-древната запазена римска
        постройка в града. Тя е част от античен комплекс от сгради, изграден по
        времето на император Константин I Велики /306-337/ в началото на ІV в.
        Приема се, че в раннохристиянската епоха е служела за баптистерий.
        Превръщането ѝ в църква става през VI в. при управлението на Юстиниан
        Велики /527-565/. Тогава е изписана за първи път. При реставрацията на
        интериора се разкриват няколко пласта стенописи от различни периоди. На
        един от тях е запазено изображението на ангел от IX в. с неговия
        изключително одухотворен човешки образ, което го прави уникален.
      </p>
      <h3>Католическа църква "Св. Йосиф"</h3>
      <img
        src={catholic}
        alt="Sv. Yosif"
        style={{ width: "500px", marginBottom: "1rem" }}
      />
      <p>
        През 1878 г. започва строеж на малка църква със средства, дарени от
        австрийския император Франц Йосиф II. През 1944 г. тя е разрушена при
        бомбардировки през Втората световна война. Събраните средства за
        възстановяване на храма изчезват при комунистическата власт. При
        посещението на папа Йоан Павел II в България през 2002 г. се освещава
        полагането на първия камък за строежа на новата катедрала. Проектът е на
        архитектите К. Пеев и С. Янев. Катедралата е осветена през 2006 г.,
        оборудвана е с орган и е най-голямата в България. Пред катедралата се
        намира статуята на блажения папа Йоан XXIII, която е осветена от папа
        Йоан Павел II. Така град София се превръща в единствения град в света,
        където храмове на четирите основни религии са разположени толкова близо
        един до друг.
      </p>
      <h3>Централна джамия "Баня Баши"</h3>
      <img
        src={mosque}
        alt="Mosque"
        style={{ width: "500px", marginBottom: "1rem" }}
      />
      <p>
        Името на джамията, което означава „при банята”, подсказва
        принадлежността ѝ към някогашния турски комплекс, в който влиза и
        красивата мраморна постройка на минералната баня. Построена е по проект
        на най-изтъкнатия архитект в историята на Османската империя Мимар
        Синан, със средствата на богатия съдия Молла Сейфуллах в памет на
        починалата му съпруга през 1566-1567 г. Стените ѝ са иззидани от дялан
        камък, като между каменните редове са поставени червени тухли.
        Централният купол е покрит с оловни пластини.
      </p>
      <h3>Централна баня</h3>
      <img
        src={bath}
        alt="Bath"
        style={{ width: "500px", marginBottom: "1rem" }}
      />
      <p>
        Софийската минерална баня, днес Регионален исторически музей - София, е
        строена в периода 1906 –1913 г. по проект на арх. Ф. Грюнангер и П.
        Момчилов. Сградата е в т.нар. национален романтичен стил. За външната
        украса е ползвана майолика в духа на европейския сецесион, по проект на
        художника Харалампи Тачев и изпълнение на Стефан Димитров. Днес, след
        извършени реставрационни дейности, Софийската минерална баня е с нови
        функции – на Регионален исторически музей - София.
      </p>
      <h3>Централни хали</h3>
      <img
        src={shop}
        alt="Shop"
        style={{ width: "500px", marginBottom: "1rem" }}
      />
      <p>
        Централните градски хали - сградата е построена по проект на арх. Наум
        Торбов на площ от 3200 кв. м на бул. „Княгиня Мария Луиза“. Строежът
        продължава от 1909 до 1911 г. Металната конструкция е повлияна от
        модерната за времето павилионна архитектура от Парижкото изложение през
        1900 г. Над входа на халите е монтиран гербът на София, а на покрива се
        издига часовникова кула. В приземния етаж са експонирани старини от
        древна Сердика.
      </p>
      <h3>Софийска синагога</h3>
      <img
        src={synagogue}
        alt="Synagogue"
        style={{ width: "500px", marginBottom: "1rem" }}
      />
      <p>
        Това е третата по-големина синагога в Европа. Завършена през 1909 г., по
        проект на придворния архитект Фридрих Грюнангер. Сградата е шедьовър на
        архитектурата, демонстрация на уникален синтез от мавритански и
        византийски стилови черти. Особено пищен е интериорът, чието декоративно
        решение се дължи на Харалампи Тачев.
      </p>
      <h3>Съдебна палата</h3>
      <img
        src={palace}
        alt="Palace of Justice"
        style={{ width: "500px", marginBottom: "1rem" }}
      />
      <p>
        Съдебната палата – храмът на българското правосъдие. Историята на
        строежа е продължителна, преминала през множество национални и
        международни конкурси и се проточва 49 години. Първият проект за сграда
        край Градската градина е изработен от арх. Ф. Грюнангер през 1886 г.
        Проектът на арх. Никола Лазаров за днешното място на палата печели
        конкурса през 1912-1914 г. През 1928 г. арх. Пенчо Койчев запазва
        плановата структура на Н. Лазаров, но променя значително фасадното
        оформление от еклектика с елементи на барок към по-строг неокласицизъм.
        Сградата на Съдебната палата е окончателно завършена през 1940 г.
        Сградата е синтез на монументална архитектура със скулптура, стъклопис и
        мозайка. По интериора работят изявени български скулптори и художници –
        Любомир Далчев, Дечко Узунов, Иван Пенков. Лъвовете от двете страни на
        входа са дело на Величко Минеков.
      </p>
    </div>
  );
};

export default Message;
